app/controllers/reviews_controller.rb

  def create
    # @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "This movie was amazing"], ["created_at", "2016-03-16 17:42:39.068527"], ["movie_id", 1], ["name", "Dan"], ["stars", 4], ["updated_at", "2016-03-16 17:42:39.068527"]]